import random
#константа
HANGMAN = (
"""
 /-----------
 |          |
 |          |
 |
 |
 |
 |
 |        
 |        
 |
 |
 |
 |
 |
 |
 |
/-------------/
"""
  ,
"""
 /-----------
 |          |
 |          |
 |         (0)
 |
 |
 |
 |        
 |        
 |
 |
 |
 |
 |
 |
 |
/-------------/
"""
  ,
"""
 /-----------
 |          |
 |          |
 |         (0)
 |        ~~^~~
 |
 |
 |        
 |        
 |
 |
 |
 |
 |
 |
 |
/-------------/
"""
  ,
"""
 /-----------
 |          |
 |          |
 |         (0)
 |        ~~^~~
 |          |
 |          
 |        
 |        
 |
 |
 |
 |
 |
 |
 |
/-------------/
"""
  ,
"""
 /-----------
 |          |
 |          |
 |         (0)
 |        ~~^~~
 |          |
 |          |
 |        
 |        
 |
 |
 |
 |
 |
 |
 |
/-------------/
"""
  ,
"""
 /-----------
 |          |
 |          |
 |         (0)
 |        ~~^~~
 |          |
 |          |
 |         /
 |        
 |
 |
 |
 |
 |
 |
 |
/-------------/
"""
  ,
"""
 /-----------
 |          |
 |          |
 |         (0)
 |        ~~^~~
 |          |
 |          |
 |         / \     
 |        
 |
 |
 |
 |
 |
 |
 |
/-------------/
"""
  ,
"""
 /-----------
 |          |
 |          |
 |         (0)
 |        ~~^~~
 |          |
 |          |
 |         / \   
 |        
 | GAME OVER     
 |
 |   *    *    
 |     \/    
 |     /\    
 |   ______     
 |          
/-------------/
""")
MAX_WRONG = len(HANGMAN) - 1
WORDS = ("ВИСЕЛИЦА","ИГРА","ОКЕАН","ПОГОДА","PYTHON")
#инициализация переменных
word = random.choice(WORDS) #слово для отгадывания
far = "~" * len(word) #по одной тильде на каждую букву,которую нужно отгадать
wrong = 0 #количество ошибок, которые сделал игрок
used = [] #буквы, которые игрок предлагал
print("\nИГРА ВИСЕЛИЦА. УДАЧНОЙ ИГРЫ!!!")
while wrong < MAX_WRONG and far != word:
    print(HANGMAN[wrong])
    print("\nВы уже предлагали эти буквы: \n", used)
    print("\nОтгаданное вами в слове сейчас выглядит так:\n", far)
    guess = input("\n\nВведите букву: ")
    guess = guess.upper()
    while guess in used:
        print("Вы уже предлагали букву", guess)
        guess = input("\n\nВведите букву: ")
        guess = guess.upper()
    used.append(guess)
    if guess in word:
        print("\nДА! Буква", guess, "есть в слове!")
        #новая строка far с отгаданной буквой или буквами
        new = ""
        for i in range(len(word)):
            if guess == word[i]:
                new += guess
            else:
                new += far[i]
        far = new
    else:
        print("\nК сожалению, буквы", guess, "нет в слове.")
        wrong += 1
if wrong == MAX_WRONG:
    print(HANGMAN[wrong])
    print("\nВас повесили!!!")
else:
    print("\nВы отгадали слово!!!")
print("\nБыло загадано слово", word)
input("\n\nPRESS ENTER FOR EXIT")
        
